I have same problem even with 1.36 azurerm provider.

```
Terraform will perform the following actions:

  # module._secret_certmanager.data.azurerm_key_vault_secret.secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "secret"  {
      + content_type = (known after apply)
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/XXXXXXXXXXXXXXXXXXXXXXXXXXx/resourceGroups/foo-rg/providers/Microsoft.KeyVault/vaults/foo-kv"
      + name         = "bar1"
      + tags         = (known after apply)
      + value        = (sensitive value)
      + vault_uri    = (known after apply)
      + version      = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }
  # module._secret_externaldns.data.azurerm_key_vault_secret.secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "secret"  {
      + content_type = (known after apply)
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/XXXXXXXXXXXXXXXXXXXXXXXXXXx/resourceGroups/foo-rg/providers/Microsoft.KeyVault/vaults/foo-kv"
      + name         = "bar1"
      + tags         = (known after apply)
      + value        = (sensitive value)
      + vault_uri    = (known after apply)
      + version      = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }
  # module.init-secrets-bv.kubernetes_secret.secret must be replaced
-/+ resource "kubernetes_secret" "secret" {
      ~ data = (sensitive value)
      ~ id   = "vault/init-secrets" -> (known after apply)
        type = "kubernetes.io/generic"

      ~ metadata {
          ~ annotations      = {} -> (known after apply)
          ~ generation       = 0 -> (known after apply)
          ~ labels           = {
              - "herritage" = "terraform"
            } -> (known after apply)
          ~ name             = "init-secrets" -> (known after apply) # forces replacement
          ~ namespace        = "vault" -> (known after apply) # forces replacement
          ~ resource_version = "1491460" -> (known after apply)
          ~ self_link        = "/api/v1/namespaces/vault/secrets/init-secrets" -> (known after apply)
          ~ uid              = "020becfe-2274-11ea-a2db-8e7aefea2c4e" -> (known after apply)
        }
    }
```